/* automatically generated by rust-bindgen 0.65.1 */

pub const SCOTCH_NUMSTRING: &[u8; 3usize] = b"%d\0";
pub const SCOTCH_VERSION: u32 = 6;
pub const SCOTCH_RELEASE: u32 = 1;
pub const SCOTCH_PATCHLEVEL: u32 = 3;
pub const SCOTCH_COARSENNONE: u32 = 0;
pub const SCOTCH_COARSENFOLD: u32 = 256;
pub const SCOTCH_COARSENFOLDDUP: u32 = 768;
pub const SCOTCH_COARSENNOMERGE: u32 = 16384;
pub const SCOTCH_STRATDEFAULT: u32 = 0;
pub const SCOTCH_STRATQUALITY: u32 = 1;
pub const SCOTCH_STRATSPEED: u32 = 2;
pub const SCOTCH_STRATBALANCE: u32 = 4;
pub const SCOTCH_STRATSAFETY: u32 = 8;
pub const SCOTCH_STRATSCALABILITY: u32 = 16;
pub const SCOTCH_STRATRECURSIVE: u32 = 256;
pub const SCOTCH_STRATREMAP: u32 = 512;
pub const SCOTCH_STRATLEVELMAX: u32 = 4096;
pub const SCOTCH_STRATLEVELMIN: u32 = 8192;
pub const SCOTCH_STRATLEAFSIMPLE: u32 = 16384;
pub const SCOTCH_STRATSEPASIMPLE: u32 = 32768;
pub const SCOTCH_STRATDISCONNECTED: u32 = 65536;
pub type FILE = [u64; 27usize];
extern "C" {
    pub fn fclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fdopen(__fd: ::std::os::raw::c_int, __modes: *const ::std::os::raw::c_char)
        -> *mut FILE;
}
pub type SCOTCH_Idx = ::std::os::raw::c_int;
pub type SCOTCH_Num = ::std::os::raw::c_int;
pub type SCOTCH_GraphPart2 = ::std::os::raw::c_uchar;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCOTCH_Arch {
    pub dummy: [f64; 11usize],
}
#[test]
fn bindgen_test_layout_SCOTCH_Arch() {
    const UNINIT: ::std::mem::MaybeUninit<SCOTCH_Arch> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SCOTCH_Arch>(),
        88usize,
        concat!("Size of: ", stringify!(SCOTCH_Arch))
    );
    assert_eq!(
        ::std::mem::align_of::<SCOTCH_Arch>(),
        8usize,
        concat!("Alignment of ", stringify!(SCOTCH_Arch))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dummy) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SCOTCH_Arch),
            "::",
            stringify!(dummy)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCOTCH_ArchDom {
    pub dummy: [f64; 5usize],
}
#[test]
fn bindgen_test_layout_SCOTCH_ArchDom() {
    const UNINIT: ::std::mem::MaybeUninit<SCOTCH_ArchDom> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SCOTCH_ArchDom>(),
        40usize,
        concat!("Size of: ", stringify!(SCOTCH_ArchDom))
    );
    assert_eq!(
        ::std::mem::align_of::<SCOTCH_ArchDom>(),
        8usize,
        concat!("Alignment of ", stringify!(SCOTCH_ArchDom))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dummy) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SCOTCH_ArchDom),
            "::",
            stringify!(dummy)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCOTCH_Geom {
    pub dummy: [f64; 2usize],
}
#[test]
fn bindgen_test_layout_SCOTCH_Geom() {
    const UNINIT: ::std::mem::MaybeUninit<SCOTCH_Geom> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SCOTCH_Geom>(),
        16usize,
        concat!("Size of: ", stringify!(SCOTCH_Geom))
    );
    assert_eq!(
        ::std::mem::align_of::<SCOTCH_Geom>(),
        8usize,
        concat!("Alignment of ", stringify!(SCOTCH_Geom))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dummy) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SCOTCH_Geom),
            "::",
            stringify!(dummy)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCOTCH_Graph {
    pub dummy: [f64; 13usize],
}
#[test]
fn bindgen_test_layout_SCOTCH_Graph() {
    const UNINIT: ::std::mem::MaybeUninit<SCOTCH_Graph> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SCOTCH_Graph>(),
        104usize,
        concat!("Size of: ", stringify!(SCOTCH_Graph))
    );
    assert_eq!(
        ::std::mem::align_of::<SCOTCH_Graph>(),
        8usize,
        concat!("Alignment of ", stringify!(SCOTCH_Graph))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dummy) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SCOTCH_Graph),
            "::",
            stringify!(dummy)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCOTCH_Mesh {
    pub dummy: [f64; 15usize],
}
#[test]
fn bindgen_test_layout_SCOTCH_Mesh() {
    const UNINIT: ::std::mem::MaybeUninit<SCOTCH_Mesh> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SCOTCH_Mesh>(),
        120usize,
        concat!("Size of: ", stringify!(SCOTCH_Mesh))
    );
    assert_eq!(
        ::std::mem::align_of::<SCOTCH_Mesh>(),
        8usize,
        concat!("Alignment of ", stringify!(SCOTCH_Mesh))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dummy) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SCOTCH_Mesh),
            "::",
            stringify!(dummy)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCOTCH_Mapping {
    pub dummy: [f64; 4usize],
}
#[test]
fn bindgen_test_layout_SCOTCH_Mapping() {
    const UNINIT: ::std::mem::MaybeUninit<SCOTCH_Mapping> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SCOTCH_Mapping>(),
        32usize,
        concat!("Size of: ", stringify!(SCOTCH_Mapping))
    );
    assert_eq!(
        ::std::mem::align_of::<SCOTCH_Mapping>(),
        8usize,
        concat!("Alignment of ", stringify!(SCOTCH_Mapping))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dummy) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SCOTCH_Mapping),
            "::",
            stringify!(dummy)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCOTCH_Ordering {
    pub dummy: [f64; 12usize],
}
#[test]
fn bindgen_test_layout_SCOTCH_Ordering() {
    const UNINIT: ::std::mem::MaybeUninit<SCOTCH_Ordering> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SCOTCH_Ordering>(),
        96usize,
        concat!("Size of: ", stringify!(SCOTCH_Ordering))
    );
    assert_eq!(
        ::std::mem::align_of::<SCOTCH_Ordering>(),
        8usize,
        concat!("Alignment of ", stringify!(SCOTCH_Ordering))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dummy) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SCOTCH_Ordering),
            "::",
            stringify!(dummy)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCOTCH_Strat {
    pub dummy: [f64; 1usize],
}
#[test]
fn bindgen_test_layout_SCOTCH_Strat() {
    const UNINIT: ::std::mem::MaybeUninit<SCOTCH_Strat> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SCOTCH_Strat>(),
        8usize,
        concat!("Size of: ", stringify!(SCOTCH_Strat))
    );
    assert_eq!(
        ::std::mem::align_of::<SCOTCH_Strat>(),
        8usize,
        concat!("Alignment of ", stringify!(SCOTCH_Strat))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dummy) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SCOTCH_Strat),
            "::",
            stringify!(dummy)
        )
    );
}
extern "C" {
    pub fn SCOTCH_archAlloc() -> *mut SCOTCH_Arch;
}
extern "C" {
    pub fn SCOTCH_archSizeof() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SCOTCH_archInit(arg1: *mut SCOTCH_Arch) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SCOTCH_archExit(arg1: *mut SCOTCH_Arch);
}
extern "C" {
    pub fn SCOTCH_archLoad(arg1: *mut SCOTCH_Arch, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SCOTCH_archSave(arg1: *const SCOTCH_Arch, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SCOTCH_archBuild(
        arg1: *mut SCOTCH_Arch,
        arg2: *const SCOTCH_Graph,
        arg3: SCOTCH_Num,
        arg4: *const SCOTCH_Num,
        arg5: *const SCOTCH_Strat,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SCOTCH_archBuild0(
        arg1: *mut SCOTCH_Arch,
        arg2: *const SCOTCH_Graph,
